FI/Ajanvaraustiedot/Integraatiopalvelu_Ajanvaraustiedot_Esimerkkisanoma_SetScheduleStatus_Request_3.1.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lif="Lifecare.Integration.ScheduleDataService" xmlns:lif1="Lifecare.Integration.Common.Contracts" xmlns:lif2="Lifecare.Integration.ScheduleDataService.Contracts">
   <soapenv:Header/>
   <soapenv:Body>
      <lif:SetScheduleStatusRequest>
         <lif:MessageHeader>
               <lif1:MessageID>?</lif1:MessageID>
               <lif1:TransactionID>?</lif1:TransactionID>
               <lif1:SenderID>?</lif1:SenderID>
               <lif1:SenderApplication>?</lif1:SenderApplication>
               <lif1:ReceiverID>?</lif1:ReceiverID>
               <lif1:ReceiverApplication>?</lif1:ReceiverApplication>
               <lif1:CharacterSet>?</lif1:CharacterSet>
               <lif1:DataServiceURL>?</lif1:DataServiceURL>
               <lif1:UserLanguageCode>?</lif1:UserLanguageCode>
               <lif1:VersionNumber>?</lif1:VersionNumber>
         </lif:MessageHeader>
         <lif:Common>
               <lif1:ContractKey>aaaabbbbbcccccc</lif1:ContractKey>
               <lif1:CallingSystem>Keksi</lif1:CallingSystem>
               <lif1:Area>
                  <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>1211Y</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:Area>
               <lif1:UserIdentifiers>
                  <lif1:UserIdentifier>
                     <lif1:UserIdentifierCodeId>EFFICA_USER_ID</lif1:UserIdentifierCodeId>
                     <lif1:UserIdentifierCode>tieto</lif1:UserIdentifierCode>
                     <lif1:FamilyName>?</lif1:FamilyName>
                     <lif1:GivenNames>?</lif1:GivenNames>
                     <lif1:Profession>?</lif1:Profession>
                  </lif1:UserIdentifier>
               </lif1:UserIdentifiers>
               <lif1:Function>
                  <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>esh</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:Function>
               <lif1:ReasonCode>
                  <lif1:CodeSetName>THL- Potilastietojen katselun erityinen syy 2012</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>1</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:ReasonCode>
         </lif:Common>
         <lif:ScheduleStatus>
            <lif2:SlotId>07DCFE0B-9B13-415D-B382-FA264DF5E216</lif2:SlotId>
            <lif2:CustomerId>
               <lif2:Identifier>070171-900N</lif2:Identifier>
            </lif2:CustomerId>
            <lif2:StatusCode>CheckedIn</lif2:StatusCode>
         </lif:ScheduleStatus>
      </lif:SetScheduleStatusRequest>
   </soapenv:Body>
</soapenv:Envelope>